"""
题目：一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？
程序分析：
    设该整数为X
    X + 100 = m^2
    X + 100 + 168 = n^2
    n^2 - m^2 = 168 = (n - m) * (m + n)  # 平方差公式，
     m + n = i
     n - m = j
    由上可知，n - m 和 m - n 至少有一个是偶数
    令n = (i +ｊ) / 2，　ｍ = (i - j) / 2, 得到：i和j要么是偶数，要么是奇数,
    j * i = 168 得知i和j都是大于等于2的偶数
    如果 j >= 2, 那么1 < i < 168 / 2 + 1
"""

for i in range(1, 85):
    if 168 % i == 0:
        j = 168 / i
        if i > j and (i + j) % 2 == 0 and (i - j) % 2 == 0:
            m = (i - j) / 2
            n = (i + j) / 2
            x = m * m - 100
            print(i, ":", j, "=", x)
            #print(x)